In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [9]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [10]:
df > 0

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [11]:
dfbool = df>0

In [12]:
dfbool

       W      X      Y      Z
A   True   True  False   True
B   True   True  False   True
C  False  False   True  False
D  False   True   True  False
E   True   True  False   True

In [13]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [14]:
df[df>0]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [19]:
df['W']<0

A    False
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [24]:
df[df['W']>0][['Y','Z']]

          Y         Z
A -0.376519  0.230336
B -0.031160  1.939932
E -1.046780  1.292765

In [18]:
df[df['W']<0]

          W         X         Y         Z
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212

In [30]:
df[(df['W']<0) & (df['X']<0)]

          W        X         Y         Z
C -1.005187 -0.74179  0.187125 -0.732845

In [32]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [39]:
df.reset_index().drop('index',axis=1)

          W         X         Y         Z
0  0.386030  2.084019 -0.376519  0.230336
1  0.681209  1.035125 -0.031160  1.939932
2 -1.005187 -0.741790  0.187125 -0.732845
3 -1.382920  1.482495  0.961458 -2.141212
4  0.992573  1.192241 -1.046780  1.292765

In [40]:
newind = 'NA MO KI MU NY'.split()

In [41]:
newind

['NA', 'MO', 'KI', 'MU', 'NY']

In [42]:
df['Towns'] = newind

In [43]:
df

          W         X         Y         Z Towns
A  0.386030  2.084019 -0.376519  0.230336    NA
B  0.681209  1.035125 -0.031160  1.939932    MO
C -1.005187 -0.741790  0.187125 -0.732845    KI
D -1.382920  1.482495  0.961458 -2.141212    MU
E  0.992573  1.192241 -1.046780  1.292765    NY

In [47]:
df.set_index('Towns')

              W         X         Y         Z
Towns
NA     0.386030  2.084019 -0.376519  0.230336
MO     0.681209  1.035125 -0.031160  1.939932
KI    -1.005187 -0.741790  0.187125 -0.732845
MU    -1.382920  1.482495  0.961458 -2.141212
NY     0.992573  1.192241 -1.046780  1.292765